02_OpenFOAM_FVM/cases/Ejercicio7/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          152;
        startFace       34068;
    }
    outlet
    {
        type            patch;
        nFaces          140;
        startFace       34220;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          132;
        startFace       34360;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          34280;
        startFace       34492;
    }
)

// ************************************************************************* //
