02_OpenFOAM_FVM/cases/Ejercicio7/cylinder/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
132
(
0.00065439413
0.00065439189
0.0006543897
0.00065438741
0.00065438495
0.00065438241
0.00065437977
0.00065437703
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
