02_OpenFOAM_FVM/cases/Ejercicio7/cylinder/system/fieldAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates and writes the time averages of given list of fields.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/functions/fields/fieldAverage.cfg"

mean            yes;
prime2Mean      yes;

fields          (U p);

// ************************************************************************* //
