02_OpenFOAM_FVM/cases/Ejercicio7/cylinder/system/patchSurface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out patch surface files with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/

patch       cylinder;

fields      (p wallShearStress);

interpolate true; // If false, write cell data to the surface triangles.
                  // If true, write interpolated data at the surface points.

#includeEtc "caseDicts/functions/surface/patchSurface.cfg"
surfaceFormat   raw;
// ************************************************************************* //
