02_OpenFOAM_FVM/cases/Ejercicio7/cylinder/system/surfaceInterpolate
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the surface interpolation of a field.

\*---------------------------------------------------------------------------*/

type            surfaceInterpolate;
libs            ("libfieldFunctionObjects.so");

field           p;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
